perf/jmeter/jmeter.log
2025-11-27 10:59:37,527 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-11-27 10:59:37,581 INFO o.a.j.JMeter: Loading user properties from: C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter\apache-jmeter\bin\user.properties
2025-11-27 10:59:37,582 INFO o.a.j.JMeter: Loading system properties from: C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter\apache-jmeter\bin\system.properties
2025-11-27 10:59:37,598 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-11-27 10:59:37,598 INFO o.a.j.JMeter: Version 5.6.3
2025-11-27 10:59:37,598 INFO o.a.j.JMeter: java.version=23.0.2
2025-11-27 10:59:37,598 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-11-27 10:59:37,598 INFO o.a.j.JMeter: os.name=Windows 11
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: os.arch=amd64
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: os.version=10.0
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: java.awt.headless=true
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: Max memory     =1073741824
2025-11-27 10:59:37,599 INFO o.a.j.JMeter: Available Processors =16
2025-11-27 10:59:37,624 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-11-27 10:59:37,625 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-11-27 10:59:37,625 INFO o.a.j.JMeter: JMeterHome=C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter\apache-jmeter
2025-11-27 10:59:37,625 INFO o.a.j.JMeter: user.dir  =C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter
2025-11-27 10:59:37,626 INFO o.a.j.JMeter: PWD       =C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter
2025-11-27 10:59:37,628 INFO o.a.j.JMeter: IP: 192.168.100.69 Name: Kiarie FullName: host.docker.internal
2025-11-27 10:59:37,653 INFO o.a.j.s.FileServer: Default base='C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter'
2025-11-27 10:59:37,654 INFO o.a.j.s.FileServer: Set new base='C:\Users\ngigi\OneDrive\Documents\Mid term project\car_certify-1\perf\jmeter'
2025-11-27 10:59:38,140 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-11-27 10:59:38,202 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-11-27 10:59:38,207 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-11-27 10:59:38,213 INFO o.a.j.s.SaveService: Loading file: test-plan.jmx
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-11-27 10:59:38,303 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-11-27 10:59:38,354 INFO o.a.j.JMeter: Creating summariser <summary>
2025-11-27 10:59:38,377 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-11-27 10:59:38,379 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-27 10:59:38,379 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-27 10:59:38,388 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-11-27 10:59:38,388 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-11-27 10:59:38,539 INFO o.a.j.JMeter: Running test (1764230378539)
2025-11-27 10:59:38,565 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2025-11-27 10:59:38,565 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Users.
2025-11-27 10:59:38,565 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-11-27 10:59:38,565 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=10 delayedStart=false
2025-11-27 10:59:38,578 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-11-27 10:59:38,578 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-11-27 10:59:38,589 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2025-11-27 10:59:38,620 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Kiarie
2025-11-27 10:59:38,629 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-11-27 10:59:38,631 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-11-27 10:59:38,631 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-11-27 10:59:38,631 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-11-27 10:59:38,631 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-11-27 10:59:38,828 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-11-27 10:59:38,838 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-11-27 10:59:38,838 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-11-27 10:59:38,966 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-11-27 10:59:38,971 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-11-27 10:59:38,972 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-11-27 10:59:40,583 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2025-11-27 10:59:42,579 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2025-11-27 10:59:44,581 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2025-11-27 10:59:46,577 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2025-11-27 11:00:01,985 INFO o.a.j.r.Summariser: summary +      1 in 00:00:23 =    0.0/s Avg: 17385 Min: 17385 Max: 17385 Err:     1 (100.00%) Active: 5 Started: 5 Finished: 0
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-4
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-5
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-3
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2025-11-27 11:00:02,565 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2025-11-27 11:00:02,598 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-2
2025-11-27 11:00:02,598 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2025-11-27 11:00:02,769 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-1
2025-11-27 11:00:02,769 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2025-11-27 11:00:02,770 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-11-27 11:00:02,771 INFO o.a.j.r.Summariser: summary +     14 in 00:00:01 =   17.5/s Avg:  5895 Min:   268 Max: 23259 Err:    14 (100.00%) Active: 0 Started: 5 Finished: 5
2025-11-27 11:00:02,772 INFO o.a.j.r.Summariser: summary =     15 in 00:00:24 =    0.6/s Avg:  6661 Min:   268 Max: 23259 Err:    15 (100.00%)